(ns clj-thamil.demo.trans-demo-01
  (:use clj-thamil.core))

(வரையறு-செயல்கூறு தன்னால்-பெருக்கு
  [அ]
  (* அ அ))

(வரையறு எண்கள் [108 1008 18 63 6 12 247])

;; 1-ஆம் சுற்று

(வரையறு-செயல்கூறு சுற்று-01
  [] 
  (வரி-அச்சிடு "எண்களையும் அவற்றின் சதுர ஆக்கங்களையும்(?) அச்சிடுவது:") 
  (செய்வரிசை [எண் எண்கள்]
            (வரி-அச்சிடு (சரம் "[" எண் "] -> [" (தன்னால்-பெருக்கு எண்) "]"))))

(வரையறு சதுர-எண்கள் (விவரி தன்னால்-பெருக்கு எண்கள்))

;; 2-ஆம் சுற்று

(வரையறு-செயல்கூறு சுற்று-02
  [] 
  (வரி-அச்சிடு "மீண்டும் எண்களையும் சதுர எண்களையும் அச்சிடுவது:") 
  (செய்யோட்டம்
   (விவரி (செயல்கூறு [எ சஎ] (வரி-அச்சிடு எ "*" எ "=" சஎ)) எண்கள் சதுர-எண்கள்)))

;; எல்லாச் சுற்றும்

(வரையறு-செயல்கூறு எல்லாவற்றையும்-ஓட்டு
  []
  (வைத்துக்கொள் [செயல்கூறுகள் [சுற்று-01 சுற்று-02]
              ஓட்டும்-செயல்கூறுகள் (பிண்ணு வரி-அச்சிடு செயல்கூறுகள்)]
             (செய்வரிசை [செ ஓட்டும்-செயல்கூறுகள்]
               (செ))))
