(ns clj-thamil.மொழியியல்-test
  (:use clojure.test
        clj-thamil.மொழியியல்
        clj-thamil.core))

(வரையறு-பரிசோதனை அசை-உயிரெழுத்து-பரிசோதனை
  (பரிசோதிக்கும் "குறில், நெடில் செயல்கூறுகள்"
    (பரிசோதிக்கும் "குறில் செயல்கூறுகள்"
      (ஆகும் (உண்மையா? (குறிலா? "அ")))
      (ஆகும் (உண்மையா? (குறிலா? "இ")))
      (ஆகும் (உண்மையா? (குறிலா? "உ")))
      (ஆகும் (உண்மையா? (குறிலா? "எ")))
      (ஆகும் (உண்மையா? (குறிலா? "ஒ")))
      (ஆகும் (பொய்மையா? (குறிலா? "ஆ")))
      (ஆகும் (பொய்மையா? (குறிலா? "ஈ")))
      (ஆகும் (பொய்மையா? (குறிலா? "ஊ")))
      (ஆகும் (பொய்மையா? (குறிலா? "ஏ")))
      (ஆகும் (பொய்மையா? (குறிலா? "ஓ")))
      (ஆகும் (பொய்மையா? (குறிலா? "ஐ")))
      (ஆகும் (பொய்மையா? (குறிலா? "ஔ")))
      (ஆகும் (பொய்மையா? (குறிலா? nil)))
      (ஆகும் (பொய்மையா? (குறிலா? ""))))
    (பரிசோதிக்கும் "நெடில் செயல்கூறுகள்"
      (ஆகும் (பொய்மையா? (நெடிலா? "அ")))
      (ஆகும் (பொய்மையா? (நெடிலா? "இ")))
      (ஆகும் (பொய்மையா? (நெடிலா? "உ")))
      (ஆகும் (பொய்மையா? (நெடிலா? "எ")))
      (ஆகும் (பொய்மையா? (நெடிலா? "ஒ"))) 
      (ஆகும் (உண்மையா? (நெடிலா? "ஆ")))
      (ஆகும் (உண்மையா? (நெடிலா? "ஈ")))
      (ஆகும் (உண்மையா? (நெடிலா? "ஊ")))
      (ஆகும் (உண்மையா? (நெடிலா? "ஏ")))
      (ஆகும் (உண்மையா? (நெடிலா? "ஓ")))
      (ஆகும் (பொய்மையா? (நெடிலா? "ஐ")))
      (ஆகும் (பொய்மையா? (நெடிலா? "ஔ")))
      (ஆகும் (பொய்மையா? (நெடிலா? nil)))
      (ஆகும் (பொய்மையா? (நெடிலா? ""))))))

(வரையறு-பரிசோதனை பன்மை-பரிசோதனை
  (பரிசோதிக்கும் "பன்மை"
    (ஆகும் (= "கற்கள்" (பன்மை-ஆக்கு "கல்")))
    (ஆகும் (= "முட்கள்" (பன்மை-ஆக்கு "முள்")))
    (ஆகும் (= "பற்கள்" (பன்மை-ஆக்கு "பல்")))
    (ஆகும் (= "தீக்கள்" (பன்மை-ஆக்கு "தீ")))
    (ஆகும் (= "பூக்கள்" (பன்மை-ஆக்கு "பூ")))
    (ஆகும் (= "பசுக்கள்" (பன்மை-ஆக்கு "பசு")))
    (ஆகும் (= "காடுகள்" (பன்மை-ஆக்கு "காடு")))
    (ஆகும் (= "மரங்கள்" (பன்மை-ஆக்கு "மரம்")))
    (ஆகும் (= "நாள்கள்" (பன்மை-ஆக்கு "நாள்")))))

(வரையறு-பரிசோதனை சந்தி-பொது-விதி-பரிசோதனை
  (பரிசோதிக்கும் "சந்தி பொது விதிகள்"
    (ஆகும் (= "தமிழ்நாடு" (சந்தி "தமிழ்" "நாடு")))
    (ஆகும் (= "தமிழீழம்" (சந்தி "தமிழ்" "ஈழம்")))
    (ஆகும் (= "செய்யளம்" (சந்தி "செய்" "அளம்")))
    (ஆகும் (= "கல்லாறு" (சந்தி "கல்" "ஆறு")))
    (ஆகும் (= "தேயிலை" (சந்தி "தே" "இலை")))
    (ஆகும் (= "மலையகம்" (சந்தி "மலை" "அகம்")))
    (ஆகும் (= "குடியுரிமை" (சந்தி "குடி" "உரிமை")))
    (ஆகும் (= "கையோடு" (சந்தி "கை" "ஓடு")))
    (ஆகும் (= "வேருடன்" (சந்தி "வேர்" "உடன்")))
    (ஆகும் (= "புழுவுக்கு" (சந்தி "புழு" "உக்கு")))
    (ஆகும் (= "புல்லை" (சந்தி "புல்" "ஐ")))
    (ஆகும் (= "பிடிக்கும்" (சந்தி "பிடி" "க்கும்")))
    (ஆகும் (= "சிலம்பாட்டம்" (சந்தி "சிலம்பு" "ஆட்டம்")))
    (ஆகும் (= "தூண்கள்" (சந்தி "தூண்" "கள்")))))
