(ns clj-thamil.மொழியியல்-test
  (:use clojure.test
        clj-thamil.மொழியியல்
        clj-thamil.core))

(வரையறு-பரிசோதனை அசை-உயிரெழுத்து-பரிசோதனை
  (பரிசோதிக்கும் "குறில், நெடில் செயல்கூறுகள்"
    (பரிசோதிக்கும் "குறில் செயல்கூறுகள்"
      (ஆகும் (உண்மையா? (குறிலா? "அ")))
      (ஆகும் (உண்மையா? (குறிலா? "இ")))
      (ஆகும் (உண்மையா? (குறிலா? "உ")))
      (ஆகும் (உண்மையா? (குறிலா? "எ")))
      (ஆகும் (உண்மையா? (குறிலா? "ஒ")))
      (ஆகும் (பொய்மையா? (குறிலா? "ஆ")))
      (ஆகும் (பொய்மையா? (குறிலா? "ஈ")))
      (ஆகும் (பொய்மையா? (குறிலா? "ஊ")))
      (ஆகும் (பொய்மையா? (குறிலா? "ஏ")))
      (ஆகும் (பொய்மையா? (குறிலா? "ஓ")))
      (ஆகும் (பொய்மையா? (குறிலா? "ஐ")))
      (ஆகும் (பொய்மையா? (குறிலா? "ஔ")))
      (ஆகும் (பொய்மையா? (குறிலா? nil)))
      (ஆகும் (பொய்மையா? (குறிலா? ""))))
    (பரிசோதிக்கும் "நெடில் செயல்கூறுகள்"
      (ஆகும் (பொய்மையா? (நெடிலா? "அ")))
      (ஆகும் (பொய்மையா? (நெடிலா? "இ")))
      (ஆகும் (பொய்மையா? (நெடிலா? "உ")))
      (ஆகும் (பொய்மையா? (நெடிலா? "எ")))
      (ஆகும் (பொய்மையா? (நெடிலா? "ஒ"))) 
      (ஆகும் (உண்மையா? (நெடிலா? "ஆ")))
      (ஆகும் (உண்மையா? (நெடிலா? "ஈ")))
      (ஆகும் (உண்மையா? (நெடிலா? "ஊ")))
      (ஆகும் (உண்மையா? (நெடிலா? "ஏ")))
      (ஆகும் (உண்மையா? (நெடிலா? "ஓ")))
      (ஆகும் (பொய்மையா? (நெடிலா? "ஐ")))
      (ஆகும் (பொய்மையா? (நெடிலா? "ஔ")))
      (ஆகும் (பொய்மையா? (நெடிலா? nil)))
      (ஆகும் (பொய்மையா? (நெடிலா? ""))))))

(வரையறு-பரிசோதனை பன்மை-பரிசோதனை
  (பரிசோதிக்கும் "பன்மை"
    (ஆகும் (= "கற்கள்" (பன்மை-ஆக்கு "கல்")))
    (ஆகும் (= "முட்கள்" (பன்மை-ஆக்கு "முள்")))
    (ஆகும் (= "பற்கள்" (பன்மை-ஆக்கு "பல்")))
    (ஆகும் (= "தீக்கள்" (பன்மை-ஆக்கு "தீ")))
    (ஆகும் (= "பூக்கள்" (பன்மை-ஆக்கு "பூ")))
    (ஆகும் (= "பசுக்கள்" (பன்மை-ஆக்கு "பசு")))
    (ஆகும் (= "காடுகள்" (பன்மை-ஆக்கு "காடு")))
    (ஆகும் (= "மரங்கள்" (பன்மை-ஆக்கு "மரம்")))
    (ஆகும் (= "நாள்கள்" (பன்மை-ஆக்கு "நாள்")))))
